Report/SpectrumAPIFrameWorkV3/SpectrumAPIFrameWork/Data/TemplateRequest/SOAP/IDM_ACT_CREATION.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:v1="http://group.vodafone.com/contract/vho/header/v1" xmlns:v11="http://group.vodafone.com/schema/vbm/identity/customer-system-user-account/v1" xmlns:v12="http://group.vodafone.com/schema/common/v1" xmlns:urn="urn:un:unece:uncefact:documentation:standard:CoreComponentType:2" xmlns:v13="http://group.vodafone.com/schema/vbo/identity/customer-system-user-account/v1" xmlns:v14="http://group.vodafone.com/schema/extension/vbo/identity/customer-system-user-account/v1">
   <soapenv:Header>
      <v1:Correlation>
         <v1:ConversationID>Trsaction_UT01</v1:ConversationID>
      </v1:Correlation>
      <v1:Source>
         <v1:System>CRM</v1:System>
      </v1:Source>
   </soapenv:Header>
   <soapenv:Body>
      <v11:CreateCustomerSystemUserAccountVBMRequest>
         <v11:CustomerSystemUserAccountVBO>
            <v13:Roles>
               <v13:Holder>
                  <v12:IDs>
                     <v12:ID>${IDNUMBER}$</v12:ID>
                  </v12:IDs>
                  <v12:Type>${IDTYPE}$</v12:Type>
                  <v12:IndividualName>
                     <v12:FirstName>${FIRSTNAME}$</v12:FirstName>
                     <v12:FamilyName>${LASTNAME}$</v12:FamilyName>
                  </v12:IndividualName>
                  <v12:BirthDate>
                     <urn:DateString>${DOB}$</urn:DateString>
                  </v12:BirthDate>
                  <v13:ContactPoints>
                     <v13:ContactPoint>
                        <v12:Email>
                           <v12:FullAddress>${SECONDARY_EMAILID}$</v12:FullAddress>
                        </v12:Email>
                     </v13:ContactPoint>
                  </v13:ContactPoints>
               </v13:Holder>
            </v13:Roles>
            <v13:Parts>             
               <v13:AccountLogins>
                  <v13:AccountLogin>
                     <v12:IDs>
                        <v12:ID>${PRIMARY_EMAILID}$</v12:ID>
                     </v12:IDs>
                  </v13:AccountLogin>
               </v13:AccountLogins>
            </v13:Parts>
         </v11:CustomerSystemUserAccountVBO>
      </v11:CreateCustomerSystemUserAccountVBMRequest>
   </soapenv:Body>
</soapenv:Envelope>